In [16]:
import pandas as pd

people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

## ADD COLUMN

In [17]:
# E' possibile ottenere una Series unendo e Series

df['first'] + ' ' +df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [18]:
# E' possibile aggiungere una nuova Series al DataFrame (creando una nuova colonna)

df['nome completo']= df['first'] + ' ' +df['last']
df

   first     last                    email  nome completo
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [19]:
# Per creare la nuova colonna è possibile utilizzare anche  il metodo apply per applicare una funzione che valorizzi la
# nuova colonna

## REMOVE COLUMN

In [20]:
# UDevo utilizzare il metodo .drop() del DataFrame, passando i nomi delle colonne da rimuovere
df.drop(columns=['first', 'last'])

                     email  nome completo
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [21]:
# Per rendere effettive le modificheal DataFrame
df.drop(columns=['first', 'last'], inplace=True)
df

                     email  nome completo
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [22]:
# Per riottenere il nome e il cognome divisi utilizzo  il metodo split()

In [23]:
# Passando a split() il parametro expand=True, la lista ottenuta crea un nuovo DataFrame

df['nome completo'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [24]:
# Per assegnare le 2 colonne ottenute al dataframe iniziale (assegnando dei nomi alle  nuove colonne)
df[['first', 'last']] = df['nome completo'].str.split(' ', expand=True)
df

                     email  nome completo  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

## ADD ROWS

In [25]:
# Un possibile metodo è utilizzare il metodo .append() passando come parametro un dict con i valori per tutte le colonne
df.append({'first' : 'toni'}, ignore_index=True)

                     email  nome completo  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   toni      NaN

In [26]:
# E' anche possibile unire 2 diversi DataFrames (anche se non dello stesso numero di colonne)
people2 = {
    "first": ["Diego", 'Mario'], 
    "last": ["Mavilla", 'Russo'], 
    "email": ["diego.mavilla@gmail.com", 'mario.russo@email.com']
}

df2 = pd.DataFrame(people2)
df2

   first     last                    email
0  Diego  Mavilla  diego.mavilla@gmail.com
1  Mario    Russo    mario.russo@email.com

In [27]:
# i 2 DataFrame ve, sortngono concatenati sulla base dei nomi di colonne corrispondenti
df.append(df2, ignore_index=True)

                     email  nome completo  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3  diego.mavilla@gmail.com            NaN  Diego  Mavilla
4    mario.russo@email.com            NaN  Mario    Russo

In [28]:
# Per rendere effettive le modifiche devo assegnare il nuovo DataFrame al vecchio (non esiste inplace)
df = df.append(df2, ignore_index=True)
df

                     email  nome completo  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3  diego.mavilla@gmail.com            NaN  Diego  Mavilla
4    mario.russo@email.com            NaN  Mario    Russo

## REMOVE ROWS

In [29]:
# Anche per le rows si utilizza drop() passando l'indice della row da cancellare
df.drop(index=2)

                     email  nome completo  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
3  diego.mavilla@gmail.com            NaN  Diego  Mavilla
4    mario.russo@email.com            NaN  Mario    Russo

In [36]:
# Per cancellare una row sulla base di una condizione (applicando un filtro)
filt= (df['last'] == 'Doe')
df.drop(index=df[filt].index)

                     email  nome completo  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3  diego.mavilla@gmail.com            NaN  Diego  Mavilla
4    mario.russo@email.com            NaN  Mario    Russo